data/NASA_2DWMH/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ( "libfrozenIncompressibleTurbulenceModels.so" );

startFrom       latestTime;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    timeStep;

writeInterval   $endTime;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #includeFunc residuals
    #includeFunc wallValues
    #includeFunc convergenceProbes
    #includeFunc singleGraph_x0.8c
    #includeFunc singleGraph_x0.9c
    #includeFunc singleGraph_x0.65c
    #includeFunc singleGraph_x1.0c
    #includeFunc singleGraph_x1.1c
    #includeFunc singleGraph_x1.2c
    #includeFunc singleGraph_x1.3c
    
}


// ************************************************************************* //
