data/NASA_2DWMH/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

#include "../caseDef"
#include "inletOutletFields/U_inlet"

internalField   uniform ($Uinf 0. 0.);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $U_inlet;
    }

    bottom
    {
        type            noSlip;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    sides
    {
        type            empty;
    }
    
    top
    {
        type            symmetry;
    }

}

// ************************************************************************* //
