data/NASA_2DWMH/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

#include "../caseDef"

internalField   uniform $nut;

boundaryField
{

    inlet
    {
        type            calculated;
        value           uniform $nut;
    }

    bottom
    {
        type            nutUSpaldingWallFunction;
        value           uniform $nut;
    }
    
    outlet
    {
        type            calculated;
        value           uniform $nut;
    }
    
    sides
    {
        type            empty;
    }
    
    top
    {
        type            symmetry;
    }

}

// ************************************************************************* //
