data/NASA_2DWMH/system/gradU
gradU
{     
// Mandatory entries     
type            grad;     
libs            ("libfieldFunctionObjects.so");     
field           U;     

// Optional (inherited) entries     
result          gradU;     
}
